In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
gdp_df = pd.read_csv('../data/gdp_percapita.csv')
gdp_df.head(6)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2020  1970.560169              NaN
1     Afghanistan  2019  2065.036235              NaN
2     Afghanistan  2018  2033.804389              NaN
3     Afghanistan  2017  2058.400221              NaN
4     Afghanistan  2016  2057.067978              NaN
5     Afghanistan  2015  2068.265904              NaN

In [3]:
gdp_df.shape

(7176, 4)

In [4]:
internet_df = pd.read_csv('../data/internet_use.csv', nrows = 4495)
internet_df.shape

(4495, 4)

In [5]:
gdp_df.columns.dtype

dtype('O')

In [6]:
internet_df.columns.dtype

dtype('O')

In [7]:
gdp_df.tail(10)

     Country or Area  Year        Value  Value Footnotes
7166        Zimbabwe  1999  2872.714795              NaN
7167        Zimbabwe  1998  2915.052992              NaN
7168        Zimbabwe  1997  2856.118188              NaN
7169        Zimbabwe  1996  2808.558556              NaN
7170        Zimbabwe  1995  2573.993785              NaN
7171        Zimbabwe  1994  2603.927369              NaN
7172        Zimbabwe  1993  2420.092791              NaN
7173        Zimbabwe  1992  2437.152908              NaN
7174        Zimbabwe  1991  2733.696626              NaN
7175        Zimbabwe  1990  2652.129209              NaN

In [8]:
internet_df.tail(10)

     Country or Area  Year     Value  Value Footnotes
4485        Zimbabwe  2002  3.994356              NaN
4486        Zimbabwe  2001  0.799846              NaN
4487        Zimbabwe  2000  0.401434              NaN
4488        Zimbabwe  1999  0.161676              NaN
4489        Zimbabwe  1998  0.081648              NaN
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN

In [9]:
gdp_df = gdp_df.drop('Value Footnotes',axis = 1)

In [12]:
gdp_df.head()

  Country or Area  Year        Value
0     Afghanistan  2020  1970.560169
1     Afghanistan  2019  2065.036235
2     Afghanistan  2018  2033.804389
3     Afghanistan  2017  2058.400221
4     Afghanistan  2016  2057.067978

In [10]:
internet_df = internet_df.drop('Value Footnotes', axis = 1)

In [13]:
internet_df.head()

  Country or Area  Year     Value
0     Afghanistan  2014  6.390000
1     Afghanistan  2013  5.900000
2     Afghanistan  2012  5.454545
3     Afghanistan  2011  5.000000
4     Afghanistan  2010  4.000000

In [18]:
gdp_df = gdp_df.rename(columns ={'Country or Area': 'Country', 'Value': 'GDP_Per_Capita'})

In [19]:
internet_df = internet_df.rename(columns ={'Country or Area': 'Country', 'Value': 'Internet_Users_Pct'})

In [20]:
gdp_and_internet_use_df = pd.merge(gdp_df, internet_df, on = ['Year', 'Country'])

In [21]:
gdp_and_internet_use_df.head()

       Country  Year  GDP_Per_Capita  Internet_Users_Pct
0  Afghanistan  2014     2102.384604            6.390000
1  Afghanistan  2013     2116.465258            5.900000
2  Afghanistan  2012     2075.491614            5.454545
3  Afghanistan  2011     1904.559926            5.000000
4  Afghanistan  2010     1957.029070            4.000000

In [22]:
gdp_and_internet_use_df.tail()

       Country  Year  GDP_Per_Capita  Internet_Users_Pct
3410  Zimbabwe  1997     2856.118188            0.033080
3411  Zimbabwe  1996     2808.558556            0.016790
3412  Zimbabwe  1995     2573.993785            0.007684
3413  Zimbabwe  1994     2603.927369            0.001739
3414  Zimbabwe  1990     2652.129209            0.000000